import Marquee from "react-fast-marquee";


const BreakingNews = () => {
    return (
        <div className="flex">
            <button className=" btn btn-secondary">Breaking News</button>
            <Marquee pauseOnHover={true}>
                বরিশালের লঞ্চে উইঠা লইবো কেবিন রুম
                বন্ধুরে মোর বুকে লইয়া দিবো একটা ঘুম
                ঠাইসা দিবো একটা ঘুম

                বরিশালের লঞ্চে উইঠা নিমু কেবিন রুম
                আমি বন্ধুরে বুকে নিয়া দিমু এক ঘুম
                দিন নাই রাত নাই পুরা প্রেমেতে ঝুম
                প্রেমের আগুন নেভাবো ফুল ফায়ার ইন দা রুম
                আমার ঘুম গেছে বিদেশে বাকি সব তাপ ঝাপ
                বন্ধুরে সাথে নিয়া জমাইছি ভাব সাব
                প্লিজ ডোন্ট ডিস্টার্ব আমি আছি মিশনে
                লাইলী-মজনু আজকে রয়ে যাবে পিছনে
                ভালোবাসা যা আছে সব দিমু বিলায়া
                চলতাসে প্রেম পাড়া পড়শী রে হিলায়া
                প্রেমের শরবত দিসি বন্ধুরে গিলায়া
                কি চলে ভাই সব কইতাসি চিল্লাইয়া

                আমার হাতে মোবাইল ফোন বন্ধুর হাতে ক্যামেরা
                জিজ্ঞাস করলে উত্তর দিব সাংবাদিক আমরা
                আমার হাতে মোবাইল ফোন বন্ধুর হাতে ক্যামেরা
                জিজ্ঞাস করলে উত্তর দিব সাংবাদিক আমরা
                আদর করে আমায় বলবে প্রিয়ারি হে তুম
                বন্ধুরে মোর বুকে লইয়া দিবো একটা ঘুম
                ঠাইসা দিবো একটা ঘুম

                আমার হাতে মোবাইল আর বন্ধুর হাতে ক্যামেরা
                বন্ধু আমার চিজ ভাই মাসআল্লাহ চেহেরা
                কেউ জিগাইলে কস আমরা সাংবাদিক
                আমরা লিখতাসি প্রেমেরই হট টপিক
                লঞ্চ চলতাসে নদীর উপর দৌড়াইয়া
                বন্ধু ধরতাসে বারে বারে জড়াইয়া
                আমি পইড়া গেছি বন্ধুর পিনিকে
                আমি ফাইসা গেছি বন্ধুর রূপের খাড়া ঝিলিকে
                গ্যাপ থাকবো না আদরে
                সব আদর সোহাগ লাইগা থাকবো ক্যাবিনের চাদরে

                বরিশালের লঞ্চে উইঠায় লইবো কেবিন রুম
                বন্ধুরে মোর বুকে লইয়া দিবো একটা ঘুম
                ঠাইসা দিবো একটা ঘুম

                বরিশালের লঞ্চে উইঠায় লইবো কেবিন রুম
                বন্ধুরে মোর বুকে লইয়া দিবো একটা ঘুম
                ঠাইসা দিবো একটা ঘুম
            </Marquee>
        </div>
    );
};

export default BreakingNews;